{
    " ": "\n\n\n____    ____            ____\n`MM'    `MM'           6MMMMb\n MM      MM           8P    Y8\n MM      MM   ____   6M      Mb __ ____     ____\n MM      MM  6MMMMb  MM      MM `M6MMMMb   6MMMMb\\\n MMMMMMMMMM MM'  `Mb MM      MM  MM'  `Mb MM'    `\n MM      MM      ,MM MM      MM  MM    MM YM.\n MM      MM     ,MM' MM      MM  MM    MM  YMMMMb\n MM      MM   ,M'    YM      M9  MM    MM      `Mb\n MM      MM ,M'       8b    d8   MM.  ,M9 L    ,MM\n_MM_    _MM_MMMMMMMM   YMMMM9    MMYMMM9  MYMMMM9\n                                 MM\n                                 MM\n                                _MM_\n\n\n\n\nH2Ops is a ML project template that helps you create standardized projects across BC and also providing you with a MLOps framework (currently local) to streamline your ML projects.\n\nIn this Cookiecutter ML project template: H2Ops, you will get the following questions.\n\nProject Name: Please provide your project name (only spaces, dots, underscores or dashes special characters allowed)\n\nUse Minio: Whether you would like to use MinIO as your local S3 storage for mimicking actual S3 operations? If you do not, a folder names `mlflow_artifacts` will be created locally where the models will be stored. To store the data, you would have to now either store it locally or on AWS S3 if you do not choose the MinIO option.\n\nShow Airflow DAG examples: Do you want to see the out-of-the-box airflow examples? These examples would be visible in the Airflow UI and in the examples folder in the dag directory. (Highly recommeded for first time users!!)\n\nShow ML package examples: If you would like to see an example ML project working end-to-end, please select yes. (Highly recommeded for first time users!!)\n\nUse Dag-factory: Do you want to use the dag-factory tool to create DAGs using a config file? If not, you would have to create your own DAGs in python. Examples will be provided for the method that you choose. Use dag-factory either when\n  i) you like .yml configuration files more than Python.\n  ii) you have tried the Pythonic way of creating DAGs and would now like to switch to something simpler\nUse the python version of creating dags; well, if you like working in Python.\n\nFolder name: By default, we will provide you with a folder name based on your project name. If you don't like it, you can change it in this option.\n\nPackage Name: Please provide a package name where you will develop your project. It should be different than the folder name.\n\n[Please press enter to continue]",
    "project_name": "Enter the name of your ML Project",
    "use_minio": [
        "yes",
        "no"
    ],
    "show_airflow_dag_examples": [
        "yes",
        "no"
    ],
    "show_ml_package_examples": [
        "yes",
        "no"
    ],
    "use_dag_factory": [
        "yes",
        "no"
    ],
    "folder_name": "{{ cookiecutter.project_name.lower().replace(' ', '_').replace('-', '_').replace('.', '_') }}",
    "package_name": "Enter your package name (should be different from folder name, only underscores allowed)"
}
